publications.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-03-04 Fri 14:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Publications</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Martin R. Albrecht" />
<meta  name="keywords" content="malb" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="content">
<h1 class="title">Publications</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Theses</a></li>
<li><a href="#orgheadline2">Journal articles</a></li>
<li><a href="#orgheadline13">Peer-reviewed conference publications</a>
<ul>
<li><a href="#orgheadline3">2016</a></li>
<li><a href="#orgheadline4">2015</a></li>
<li><a href="#orgheadline5">2014</a></li>
<li><a href="#orgheadline6">2013</a></li>
<li><a href="#orgheadline7">2012</a></li>
<li><a href="#orgheadline8">2011</a></li>
<li><a href="#orgheadline9">2010</a></li>
<li><a href="#orgheadline10">2009</a></li>
<li><a href="#orgheadline11">2006</a></li>
<li><a href="#orgheadline12">2005</a></li>
</ul>
</li>
<li><a href="#orgheadline14">Other publications</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Theses</h2>
<div class="outline-text-2" id="text-orgheadline1">
<ul class="org-ul">
<li>Martin Albrecht. <a href="http://martinralbrecht.files.wordpress.com/2010/10/phd.pdf">Algorithmic Algebraic Techniques and their Application to Block Cipher Cryptanalysis</a>. PhD thesis, Royal Holloway, University of London, 2010</li>
<li>Martin Albrecht. <a href="./papers/algebraic-attacks-on-the-courtois-toy-cipher--diplomarbeit.pdf">Algebraic Attacks against the Courtois Toy Cipher</a>. Diplomarbeit, Universität Bremen. 2007.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Journal articles</h2>
<div class="outline-text-2" id="text-orgheadline2">
<ul class="org-ul">
<li>Martin R. Albrecht, Rachel Player and Sam Scott. <i>On the concrete hardness of Learning with Errors</i> in <i>Journal of Mathematical Cryptology</i> 9(3):169-203 (2015), DOI: <a href="http://dx.doi.org/10.1515/jmc-2015-0016">10.1515/jmc-2015-0016</a>. pre-print available as <a href="http://ia.cr/2015/046">Cryptology ePrint Archive: Report 2015/046</a>.</li>
<li>Martin R. Albrecht, Jean-Charles Faugère, Pooya Farshim, Gottfried Herold, and Ludovic Perret. <i>Polly Cracker, revisited</i> in <i>Designs, Codes and Cryptography</i> (2015), pp. 1–42. DOI: <a href="http://dx.doi.org/10.1007/s10623-015-0048-8">10.1007/s10623-015-0048-8</a>. pre-print available as <a href="http://ia.cr/2011/289">Cryptology ePrint Archive: Report 2011/289</a>.</li>
<li>Martin R. Albrecht, Carlos Cid, Jean-Charles Faugère, Robert Fitzpatrick and Ludovic Perret. <i>On the complexity of the BKW algorithm on LWE</i> in <i>Designs, Codes and Cryptography</i>, Volume 74, <a href="http://link.springer.com/journal/10623/74/2/page/1">Issue 2</a>, pages 325-354. 2015. pre-print available as <a href="http://ia.cr/2012/636">Cryptology ePrint Archive: Report 2012/636</a>.</li>
<li>Martin Albrecht, Carlos Cid, Jean-Charles Faugère and Ludovic Perret. <i>On the relation between the MXL family of algorithms and Gröbner basis algorithms</i> in <i>Journal of Symbolic Computation</i>. 2012. <a href="http://ia.cr/2011/164">pre-print</a>, <a href="https://bitbucket.org/malb/papers/src/5608545eb1bb/mutant-groebner-basis">LaTeX sources</a></li>
<li>Martin Albrecht, Gregory Bard and Bill Hart. <i>Efficient Multiplication of Dense Matrices over GF(2)</i> in <i>ACM Transactions on Mathematical Software</i>. pre-print available on the <a href="http://arxiv.org/abs/0811.1714">arXiv</a>. 2008.</li>
<li>Martin Albrecht. <i>Algebraic Attacks against the Courtois Toy Cipher</i> in <i>Cryptologia</i>, Volume 32, Issue 3 July 2008 , pages 220 - 276. available at <a href="http://www.informaworld.com/smpp/content~db=all~content=a794832591~tab=citation">informaworld</a>. 2008.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13">Peer-reviewed conference publications</h2>
<div class="outline-text-2" id="text-orgheadline13">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">2016</h3>
<div class="outline-text-3" id="text-orgheadline3">
<ul class="org-ul">
<li>Martin R. Albrecht, Pooya Farshim, Dennis Hofheinz, Enrique Larraia and Kenneth G. Paterson. <i>Multilinear Maps from Obfuscation</i> in proceedings of <i>TCC (A1) 2016</i>, Springer Verlag, 2016. pre-print available as <a href="http://ia.cr/2015/780">Cryptology ePrint Archive: Report 2015/780</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">2015</h3>
<div class="outline-text-3" id="text-orgheadline4">
<ul class="org-ul">
<li>Martin R. Albrecht, Catalin Cocis, Fabien Laguillaumie and Adeline Langlois: <i>Implementing Candidate Graded Encoding Schemes from Ideal Lattices</i> in proceedings of <i>ASIACRYPT 2015</i>, Springer Verlag, 2015, pre-print available as <a href="http://ia.cr/2014/928">Cryptology ePrint Archive: Report 2014/928</a>.</li>
<li>Martin R. Albrecht, Christian Rechberger, Thomas Schneider, Tyge Tiessen and Michael Zohner. <i>Ciphers for MPC and FHE</i> in proceedings of <i>EUROCRYPT 2015</i>, Springer Verlag 2015. <a href="http://thomaschneider.de/papers/ARSTZ15.pdf">Pre-print</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">2014</h3>
<div class="outline-text-3" id="text-orgheadline5">
<ul class="org-ul">
<li>Martin R. Albrecht, Benedikt Driessen, Elif Bilge Kavun, Gregor Leander, Christof Paar and Tolga Yalcin. <i>Block Ciphers - Focus On The Linear Layer (feat. PRIDE)</i> in proceedings of <i>CRYPTO 2014</i>, Springer Verlag, 2015. <a href="http://dx.doi.org/10.1007/978-3-662-44371-2_4">10.1007/978-3-662-44371-2\_4</a>. pre-print available as <a href="https://eprint.iacr.org/2014/453">Cryptology ePrint Archive: Report 2014/453</a>.</li>
<li>Martin R. Albrecht, Jean-Charles Faugère, Robert Fitzpatrick, Ludovic Perret. <i>Lazy Modulus Switching for the BKW Algorithm on LWE</i> in proceedings of <i>PKC 2014</i>, Springer Verlag, 2014. full version available as <a href="http://ia.cr/2014/019">Cryptology ePrint Archive: Report 2014/019</a>. <a href="https://bitbucket.org/malb/papers/src/tip/lazy-modulus-switching-for-bkw-on-lwe/?at=default">LaTeX sources</a>.</li>
<li>Martin R. Albrecht. Jean-Charles Faugère, Robert Fitzpatrick, Ludovic Perret, Yosuke Todo and Keita Xagawa. <i>Practical Cryptanalysis of a Public-Key Encryption Scheme Based on New Multivariate Quadratic Assumptions</i> in proceedings of <i>PKC 2014</i>, Springer Verlag, 2014.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">2013</h3>
<div class="outline-text-3" id="text-orgheadline6">
<ul class="org-ul">
<li>Martin R. Albrecht, Robert Fitzpatrick, and Florian Göpfert: <i>On the Efficacy of Solving LWE by Reduction to Unique-SVP</i> in proceedings of <i>International Conference on Information Security and Cryptology.</i> 2013. pre-print available as <a href="http://ia.cr/2013/602">Cryptology ePrint Archive: Report 2013/602</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">2012</h3>
<div class="outline-text-3" id="text-orgheadline7">
<ul class="org-ul">
<li>Martin R. Albrecht and Gregor Leander. <i>An All-In-One Approach to Differential Cryptanalysis for Small Block Ciphers</i> in proceedings of <i>Selected Areas of Cryptography 2012</i>, Springer Verlag, 2012.</li>
<li>Martin R. Albrecht. <i>The M4RIE library for dense linear algebra over small fields with even characteristic</i> in proceedings of <i>37th International Symposium on Symbolic and Algebraic Computation</i>, ACM Press, 2012.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">2011</h3>
<div class="outline-text-3" id="text-orgheadline8">
<ul class="org-ul">
<li>Martin R. Albrecht and Kenneth G. Paterson. <i>Breaking An Identity-Based Encryption Scheme based on DHIES</i> in proceedings of <i>IMA CCC 2011</i>. Springer Verlag, 2011. pre-print available as <a href="http://ia.cr/2010/637">Cryptology ePrint Archive: Report 2010/637</a>. 2010. <a href="https://bitbucket.org/malb/papers/src/5608545eb1bb/dhies-ibe-mq-attack">LaTeX sources</a></li>
<li>Martin R. Albrecht, Pooya Farshim, Jean-Charles Faugère and Ludovic Perret. <i>Polly Cracker, Revisited</i> in Proceedings of <i>ASIACRYPT 2011</i>. Springer Verlag 2011. pre-print/full version available as <a href="http://ia.cr/2011/289">Cryptology ePrint Archive: Report 2011/289</a>. 2011. <a href="https://bitbucket.org/malb/papers/src/tip/polly-cracker-revisited-extended-abstract">LaTeX sources</a></li>
<li>Martin Albrecht and Carlos Cid. <i>Cold Boot Key Recovery by Solving Polynomial Systems with Noise</i> in proceedings of <i>9th International Conference on Applied Cryptography and Network Security</i>. Springer Verlag, 2011. <a href="http://martinralbrecht.files.wordpress.com/2010/07/paper.pdf">local copy</a>, <a href="https://bitbucket.org/malb/papers/src/5608545eb1bb/coldboot-attacks-max-posso">LaTeX sources</a>.</li>
<li>Martin R. Albrecht, Pooya Farshim, Kenneth G. Paterson and Gaven J. Watson. <i>On Cipher-Dependent Related-Key Attacks in the Ideal Cipher Model</i> in proceedings of <i>FSE 2011</i>, 2011.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">2010</h3>
<div class="outline-text-3" id="text-orgheadline9">
<ul class="org-ul">
<li>Martin Albrecht, Carlos Cid, Thomas Dullien, Jean-Charles Faugère and Ludovic Perret. <i>Algebraic Precomputations in Differential and Integral Cryptanalysis</i> in proceedings of <i>INSCRYPT 2010</i>, Shanghai, China, October 2010 (<a href="http://martinralbrecht.files.wordpress.com/2010/10/adc2.pdf">local copy</a>). An earlier version of this work was presented at the ECrypt <i>Workshop on Tools for Cryptanalysis 2010</i>.  2010.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">2009</h3>
<div class="outline-text-3" id="text-orgheadline10">
<ul class="org-ul">
<li>Martin Albrecht, Craig Gentry, Shai Halevi and Jonathan Katz. <i>Attacking Cryptographic Schemes Based on Perturbation Polynomials</i> in proceedings of the <i>16th ACM Conference on Computer and Communications Security</i>. pre-print available as <a href="http://ia.cr/2009/098">Cryptology ePrint Archive: 2009/098</a> Report . 2009.</li>
<li>Martin Albrecht, Kenny Paterson and Gaven Watson. <i>Plaintext Recovery Attacks Against SSH</i> in proceedings of <i>IEEE Symposium on Security and Privacy 2009</i>. available <a href="http://www.informatik.uni-bremen.de/~malb/papers/plaintext_recover_attacks_against_ssh.pdf">locally</a>. 2009.</li>
<li>Martin Albrecht and Carlos Cid. <i>Algebraic Techniques in Differential Cryptanalysis</i> to proceedings of <i>Fast Software Encryption 2009</i>. pre-print available as <a href="http://ia.cr/2008/177">Cryptology ePrint Archive: 2008/177</a>. 2009. (<a href="http://bitbucket.org/malb/algebraic_attacks/src/tip/present.py">source code</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11">2006</h3>
<div class="outline-text-3" id="text-orgheadline11">
<ul class="org-ul">
<li>Martin Albrecht, Till Backhaus, Steffen Planthaber, Henning Stöpler, Dirk Spenneberg, and Frank Kirchner. <i>AIMEE: A four-legged robot for RoboCup Rescue</i> in <i>Climbing and Walking Robots</i>. Springer, 2006, pp. 1003–1010</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12">2005</h3>
<div class="outline-text-3" id="text-orgheadline12">
<ul class="org-ul">
<li>Dirk Spenneberg, Martin Albrecht, and Till Backhaus. <i>Monster: A new behavior-based microkernel for mobile robots</i> in proceedings of the <i>2nd European Conference on Mobile Robots</i>. 2005.</li>
<li>Dirk Spenneberg, Martin Albrecht, Till Backhaus, Jens Hilljegerdes, Frank Kirchner, Andreas Strack, and Heiko Zschenker. <i>Aramies: A four-legged climbing and walking robot</i> in <i>Proceedings of 8th International Symposium iSAIRAS</i>. 2005</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14">Other publications</h2>
<div class="outline-text-2" id="text-orgheadline14">
<ul class="org-ul">
<li>Martin R. Albrecht, Daniel Cabarcas, Robert Fitzpatrick, Florian Göpfert and Michael Schneider. <i>A Generator for LWE and Ring-LWE Instances</i>. available at <a href="http://www.iacr.org/news/files/2013-04-29lwe-generator.pdf">http://www.iacr.org/news/files/2013-04-29lwe-generator.pdf</a>. 2013</li>
<li>Martin Albrecht and Clément Pernet. <i>Efficient Decomposition of Dense Matrices over GF(2)</i> accepted for presentation at ECrypt <i>Workshop on Tools for Cryptanalysis 2010</i>. available on <a href="http://bitbucket.org/cpernet/pluqm4ri/overview">bitbucket</a>. 2010.</li>
<li>Martin Albrecht, Gregory Bard <i>et al.</i>. <a href="http://m4ri.sagemath.org/">M4RI Library</a>. 2007ff.</li>
<li>William Stein <i>et al.</i>. <a href="http://www.sagemath.org/">Sage</a> mathematics software. 2005ff.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
